{
    "addition": {
        "symbol": "+",
        "explanation": "Addition is the process of calculating the total of two or more numbers or amounts. For example, adding 3 and 4 gives 7."
    },
    "subtraction": {
        "symbol": "-",
        "explanation": "Subtraction involves taking one number away from another. For instance, subtracting 2 from 5 results in 3."
    },
    "multiplication": {
        "symbol": "*",
        "explanation": "Multiplication is the act of increasing one number by the value of another. For example, multiplying 3 by 4 gives 12."
    },
    "division": {
        "symbol": "÷",
        "explanation": "Division is splitting a number into equal parts. Dividing 20 by 4, for instance, results in 5."
    },
    "power": {
        "symbol": "^",
        "explanation": "Raising a number to a power means multiplying the number by itself a certain number of times. 4 raised to the power of 3(4^3) is 64 because 4 multiplied by itself twice more (a total of three times) equals 64."
    },
    "square_root": {
        "symbol": "√",
        "explanation": "The square root of a number is a value that, when multiplied by itself, gives the original number. For example, the square root of 25 is 5 because 5 times 5 equals 25."
    },
    "modulo": {
        "symbol": "%",
        "explanation": "The modulo operation finds the remainder when one number is divided by another. For instance, 7 modulo 3 equals 1 because when 7 is divided by 3, the remainder is 1."
    },
    "sine": {
        "symbol": "sin",
        "explanation": "The sine function relates an angle in a right triangle to the length of the side opposite the angle. It's commonly used in trigonometry."
    },
    "cosine": {
        "symbol": "cos",
        "explanation": "The cosine function relates an angle in a right triangle to the length of the side adjacent to the angle. It's another fundamental concept in trigonometry."
    },
    "tangent": {
        "symbol": "tan",
        "explanation": "The tangent function, in a right triangle, is the ratio of the side opposite the angle to the side adjacent. It's the division of sine by cosine."
    }
}